{"data":{"markdownRemark":{"html":"<p><em>Disclaimer: This post is not sponsored by Felix Gray and all opinions on this product are my own.</em></p>\n<p>For the last 3 months I’ve been using <a href=\"https://shopfelixgray.com/\">Felix Gray</a> glasses daily for all things screen related and then some. This review is by no means religiously technical in nature but mainly <em>my</em> perspective through real-world use.</p>\n<p><img src=\"../assets/images/2018-01-21/glasses1.jpeg\" alt=\"Felix Gray computer glasses\"></p>\n<h2>The Product</h2>\n<p>Felix Gray glasses set out to make staring at any screen (computer, tablet, phone, etc) for an extended time not only bearable, but stylish.</p>\n<p>According to Felix Gray, the average American now spends around 7.5 hours of their day staring at a screen, 50% of American jobs involve prolonged computer use, and over 50% of the population suffers from <a href=\"https://shopfelixgray.com/computer-vision-syndrome\">computer vision syndrome</a>.</p>\n<p>Felix Gray sets out to do away with these issues by offering glasses that filter out the right amount of blue light, reduce screen glare, and provide different magnification levels should you need it. In fact, <a href=\"https://shopfelixgray.com/shop\">their glasses</a> come in prescription, readers, and non-RX.</p>\n<p>To sum it up, staring at a screen for hours takes its toll on your eyes and mind, at least in my experience. Felix Gray glasses set out to eliminate these issues.</p>\n<h2>The Results</h2>\n<p>Now that you know the issue these glasses propose to fix, let’s see if they actually do so.</p>\n<p>From my personal experience with using these glasses daily for the past 3 months, I can wholeheartedly say these glasses live up to their claims and my productivity has <strong>hugely</strong> increased.</p>\n<p>As someone who never wore and has never been prescribed glasses I was skeptical. Before purchasing the glasses I didn’t think my “symptoms” were that severe to justify the purchase. The more time I spent in front of a screen however, I began to notice my eyes would tire after a couple of hours and I even began to get headaches.</p>\n<p>Upon the first day of using Felix Gray glasses I noticed an immediate difference. I found myself needing to take less breaks (if any at all) to rest my eyes, so that translated into more time in front of my computer getting more work done. I no longer had eyestrain or headaches at the end of the day. I even found myself wearing the glasses when I was going to the movies, watching TV, or playing a video game. To add, Felix Gray states your eyes will not become dependent on the lens, so if you don’t plan on wearing them all the time you won’t have to worry about your eyes having Felix Gray withdrawals.</p>\n<h2>Design &#x26; Feel</h2>\n<p><img src=\"../assets/images/2018-01-21/terrance1.jpeg\" alt=\"Terrance Corley wearing felix gray glasses\">\n<img src=\"../assets/images/2018-01-21/terrance2.jpeg\" alt=\"Terrance Corley wearing felix gray glasses\"></p>\n<p>*These selfies were taken for journalistic purposes and not for likes.\nThe frame of the glasses are made of a malleable acetate material and have nice metal hinge accents. Acetate won’t give you as much as a premium feel as say metal might, but these glasses by no means feel cheap. Since I’d never even worn sunglasses I was concerned about noticing this new foreign object on my face, but I’m glad to say these glasses are super light weight and I don’t notice them after a while. You can click here to find a pair that best suits your face.</p>\n<p>I’ve yet to find any kind of wear on my glasses as of yet and little details like the model and brand name inscribed on the insides of the arms are nice touches. My favorite detail by far though would have to be the awesome owl logo imprinted on the right arm.</p>\n<p>…and I can’t even lie. Sometimes I’ll wear these out in public just for the aesthetic. <em>insert smirk emoji</em></p>\n<p><img src=\"../assets/images/2018-01-21/glasses2.jpeg\" alt=\"Felix Gray computer glasses\"></p>\n<p>Compared to the competition I’ve seen, Felix Gray are by far the most fashionable and practical computer glasses. Aside from having a modern design, the main selling point for me is that they don’t have yellow lenses!</p>\n<p>If you google “computer glasses” right now you will see a plethora of very bad looking yellow tinted glasses. That yellow tint alone makes the competitors a no-go if you work with anything design related on a computer because you will never be looking at a true representation of whatever is on the screen. Plus, who wants to look at the world in a yellow hue. The reason a lot of computer glasses are yellow tinted is because that yellow tint filters the blue light that is detrimental to our eyes and reduces glare, but Felix Gray have developed a lens that does all of this without looking ugly.</p>\n<p>Now, Felix Gray states that color accuracy was actually a big concern when creating these glasses and for the most part they do a great job at color accuracy. But, there is a slight color to the lens. So slight, most of the time I don’t notice it but there is a grayish filter to the lens. I’m not exaggerating when I say it’s pretty unnoticeable, most of the time I don’t even notice it but every now and then I’ll find with blacks usually that the contrast is a little off.</p>\n<h2>The Verdict</h2>\n<table>\n<thead>\n<tr>\n<th align=\"center\">![Felix Gray computer glasses holding case]</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"center\"><em>You also get this nice case and a microfiber cloth.</em></td>\n</tr>\n</tbody>\n</table>\n<p>I couldn’t stress enough the value these glasses have added to my workflow. If you have <strong>any</strong> issues you’re noticing when working with a screen for any length of time, I highly recommend picking up a pair of Felix Gray glasses. At the time of writing, if you aren’t satisfied with your purchase they even offer free returns for up to 30 days. It’s like I said, your eyes will thank you. :)</p>","frontmatter":{"title":"Felix Gray Computer Glasses: Your eyes will thank you."}}},"pageContext":{"slug":"/2018-01-21-felix-gray-computer-glasses-review/"}}