{"data":{"markdownRemark":{"html":"<h2>Nourish your body</h2>\n<p>Drink more water and make healthier food choices. That's a cliché these days, but clichés are clichés for a reason, there is usually some truth to them! You don't need to track your water and calorie intake either to make a healthy change. What I do is I'll have water with my breakfast and lunch and I'll allow myself something else to drink for dinner, and I make sure to carry a water bottle with me wherever I go. As far as food, just eat out less. Look up some simple healthy recipes online and go shopping. You'll most likely save money, you'll feel better after the meal, and there are plenty of healthy meals you can whip up within 10-15 minutes.</p>\n<p>Also, please figure out your ideal sleep number. Some people really can go off 6 hours of sleep but most people need 7-8. I'm one of those people that needs at least 7 1/2 - 8 hours of sleep. I've also found it beneficial for me to keep a consistent time for falling asleep and waking up. Alarms people! Create multiple alarms for the morning...hitting that snooze button is often pretty tempting.</p>\n<h2>Ask for help and take breaks</h2>\n<p>I've been working as a software engineer on at my company for the last 4 months. When I'm stuck on something at work, or even if I just want a second opinion I don't hesitate to reach out to a co-worker. Now that doesn't mean I immediately run to them when I hit a wall, I still try to climb that wall, but if I'm spending over 30 minutes trying to debug and I'm using a lot of energy trying to figure out something, sometimes some of that energy can be saved, especially if you are fortunate enough to be on a collaborative team. Asking for help doesn't make you any \"less than\" as a dev, it builds communication skills, allows you reserve some energy you would've continued to exhuast, and next time you climb a similar wall you'll be better equipped. Don't forget to show thanks to those that help you. :) </p>\n<p>Take breaks! Stop being the tryhard. There will always be work to do, no matter how fast you solve things. Make the time to take small breaks throughout your day. Go for a walk, play some ping pong, or do what my co-workers and I do and form a secret cornhole league.</p>\n<p>Make. The. Time.</p>\n<h2>Task splitting</h2>\n<p>This one has been huge for me. Programming can seem overly complex at time, especially when you start working for a company and are tasked with creating a huge feature. I use a tool called Trello, but there are plenty of similar tools. I figured out that once you can take a huge feature and just split that into little actionable chunks, your mind doesn't feel as overwhelmed and you can focus on completing a single, much smaller piece of the whole puzzle. Before you know it you'll be looking at the completed picture. </p>\n<h2>Scheduling</h2>\n<p>Life is hectic, make a schedule. No, you are not a square for having alarms/notifications in your life. Structure is good, especially when you want to build new, healthy habits. I have alarms that wake me up, tell me to leave for work, remind me to eat lunch, remind me to workout, and remind me to read and jump into bed. Scheduling has been great for my productivity. For example, I set aside an hour every morning to write a blog post and study up on current developments in my field. You don't have to start with as many alarms as I have, just start with one or two.</p>\n<h2>Reflect</h2>\n<p>Whenever you feel stuck, down, anxious, depressed-- and this is related to programming...take a break. Take a moment. Stop and think about something you did either a day, a week, a month, or 6 months ago. Whether you learned how to use some new JavaScript method, a new framework, or just learned how to change the color of text on your. Progress is progess. Recognize that you've learned something before and will continue to learn. I'm sure if you think back enough you can find something you learned that you perhaps thought you'd never get the hang of. Don't forget to congratulate yourself for the small wins. Programming can sometimes be a thankless job, and I find it okay to celebrate your victories every now and then.  </p>\n<hr>\n<p>Thank you for taking the time to read my post today if you've made it this far! Please forgive any potential grammatical errors as I'm writing this before work and am challenging myself to post every weekday, but I don't have the time to proofread as thoroughly as I'd like to today. Happy coding!</p>","frontmatter":{"title":"5 Healthy Developer Habits","content":"Terrance Corley shares 5 of his healthy habits that have allowed him to be a more happy and efficient developer."}}},"pageContext":{"slug":"/2019-04-03-five-healthy-developer-habits/"}}